bot_responses = {
    "hello": ["Привет, путник!", "Здравствуйте!", "Приветствую!", "Добрый день!", "Здорова!", "Хай",
              "Хеллоу(да-да я из Англии)", "Привет, шеф!"],
    "how_are_you": ["Хорошо, спасибо!", "Все отлично!", "Дела хороши!", "Прогрессирую!",
                    "Все в порядке, спасибо за интерес.", "Лучше всех!",
                    "Все замечательно!", "Стабильно и хорошо.", "Дела идут вверх!", "Все просто прекрасно!"],
    'do_work': ['Ничего!', 'Жду пока мне кто-то напишет!', 'Нахожусь в режиме ожидания!', 'Учу питон!',
                'Общаюсь с вами!'],
    "jokes": ["Почему программисты на Python всегда улыбаются? Потому что у них код работает!",
              "Что делает питон после того, как закончит изучать Python? Он начинает писать свой собственный код!",
              "Почему питоны из Python такие общительные? Потому что им всегда есть что сказать!",
              "Что произойдет, если питон начнет изучать Python? Он станет самым умным питоном в мире!"],
    "anecdote": "Заходят как-то программисты на Python, C# и C++ в бар. \n"
                "Программист на Python говорит: -Мне бокал пива.  Выпил, оплатил, ушел.\n"
                "Программист на C#: Здравствуйте налейте мне, пожалуйста, пенного хмельного пива в стеклянную тару, "
                "в простонародии называемую бокалом. Минут 30 сидел, пил, оплатил, со всеми в баре попрощался и ушел.\n"
                "А программист на C++ часа три не мог открыть рот.",
    "buy": ["До свидания!", "Удачи, путник!", "До скорой встречи!", "Возвращайтесь, если что!",
            "Да пребудет с вами сила", "Ещё увидимся!"]}

locations = {
    "road": {
        "name": "Дорога трех королевств",
        "descriptions": "Путь к трём удивительным королевствам начинается с извилистой дороги, утопающей в пышной зелени"
                        " лесов. Этот путь, известен как Дорога Трех Королевств",
        "image": "https://disk.yandex.ru/i/p1yFa6W2vl_ClA"
    },
    "kingdom_light": {
        "name": "Королевство Света ☀️",
        "descriptions": "Под светлым небесным сводом, Королевство Света воссияло золотыми полями и лучистыми городами."
                        " Мириады цветов и кристаллов сверкали, отражая благосклонный свет, "
                        "наполняя все вокруг теплом и радостью.",
        "image": "https://disk.yandex.ru/i/C5sW8HmxlNMjdQ"
    },
    "kingdom_dark": {
        "name": "Королевство Тьмы 🌙",
        "descriptions": "В недрах тайного Королевства Тьмы простирался мистический мрак. "
                        "Силы тьмы, непостижимые и неуловимые, "
                        "владеют этим таинственным уголком мира.",
        "image": "https://disk.yandex.ru/i/V9ITCUqUorwxnQ"
    },
    "kingdom_magic": {
        "name": "Королевство Магии 🔮",
        "descriptions": "Волшебство воплощалось в каждом камне и лепестке в этом удивительном Королевстве Магии. "
                        "Здесь заклинания и чары были частью повседневной жизни, "
                        "а воздух наполнялся тонкой аурой волшебства.",
        "image": "https://disk.yandex.ru/i/G9cq8TaVWpGzmQ"
    },
    "light_city": {
        "name": "Лучистый город",
        "descriptions": "Лучистый город - это символ мира, надежды и красоты. "
                        "Он привлекает путешественников со всего мира, желающих увидеть его чудеса.",
        "image": "https://disk.yandex.ru/i/CAB9I8_uTBCJfA",
        "jobs": [{
            "name": "Защита каравана",
            "image": ""},
            {
                "name": "Помощь ремесленику",
                "image": ""},
            {
                "name": "Организация городского праздника",
                "image": ""
            }]
    },
    "garden": {
        "name": "Сады",
        "descriptions": "Сады – место вдохновения, где каждый цветок – часть живого полотна, "
                        "приглашающего вас отдохнуть и насладиться красотой природы.",
        "image": "https://disk.yandex.ru/i/e6w3QzpAOFfh_Q"
    },
    "dark_tunnel": {
        "name": "Темные тунели",
        "descriptions": "В паутинных просторах этих туннелей обитает страж — Гигантский Паук. "
                        "Его окаменелые глаза сверкают во мраке, а паутина, словно нить между мирами, "
                        "покрывает каждый уголок.",
        "image": "https://disk.yandex.ru/i/FdVmo70r863jiw"
    },
    "forgotten_fortress": {
        "name": "Забытая крепость",
        "descriptions": "Это место наполнено зловещей аурой и мистической энергией, словно само восстание из прошлого. "
                        "В самом сердце крепости раскинул своё гнездо Тёмный Рыцарь, хранитель древнего артефакта. "
                        "Тёмная броня, покрытая рунами, излучает тьму, а его глаза сверкают мраком в ответ на ваши шаги.",
        "image": "https://disk.yandex.ru/i/Oq5oMo5R_Xxgeg"
    }
}
